## Proxmox Terraform Plan
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # proxmox_vm_qemu.vm["k8s-home.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = (known after apply)
      + cipassword             = (sensitive value)
      + ciupgrade              = false
      + ciuser                 = "suporte"
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = false
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.16/24,gw=192.168.1.1,ip6=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 32786
      + name                   = "k8s-home"
      + nameserver             = "192.168.1.3"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 2
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIP+mJj63c+7o+Bu40wNnXwTpXkPTpGJA9OIprmNoljKI pedro@pedro-Legion-5-16IRX9"
      + tablet                 = true
      + tags                   = "terraform"
      + target_node            = "node02"
      + unused_disk            = (known after apply)
      + vm_state               = "running"
      + vmid                   = (known after apply)

      + disks {
          + ide {
              + ide1 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "100G"
                      + storage              = "local-lvm"
                    }
                }
              + scsi1 {
                  + passthrough {
                      + backup               = true
                      + file                 = "/dev/disk/by-id/usb-SanDisk_Extreme_55DD_24399K401631-0:0"
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + replicate            = true
                      + size                 = (known after apply)
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.vm["k8s-testing-cp01.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + default_ipv4_address   = (known after apply)
        id                     = "node03/qemu/104"
        name                   = "k8s-testing-cp01"
      + ssh_host               = (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
        tags                   = "terraform"
      ~ vm_state               = "running" -> "stopped"
        # (44 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["k8s-testing-cp02.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + default_ipv4_address   = (known after apply)
        id                     = "node03/qemu/103"
        name                   = "k8s-testing-cp02"
      + ssh_host               = (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
        tags                   = "terraform"
      ~ vm_state               = "running" -> "stopped"
        # (44 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["k8s-testing-cp03.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + default_ipv4_address   = (known after apply)
        id                     = "node03/qemu/112"
        name                   = "k8s-testing-cp03"
      + ssh_host               = (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
        tags                   = "terraform"
      ~ vm_state               = "running" -> "stopped"
        # (44 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["k8s-testing-w01.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + default_ipv4_address   = (known after apply)
        id                     = "node03/qemu/114"
        name                   = "k8s-testing-w01"
      + ssh_host               = (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
        tags                   = "terraform"
      ~ vm_state               = "running" -> "stopped"
        # (44 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["k8s-testing-w02.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + default_ipv4_address   = (known after apply)
        id                     = "node03/qemu/102"
        name                   = "k8s-testing-w02"
      + ssh_host               = (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
        tags                   = "terraform"
      ~ vm_state               = "running" -> "stopped"
        # (44 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm["k8s-testing-w03.yaml"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm" {
      + default_ipv4_address   = (known after apply)
        id                     = "node03/qemu/113"
        name                   = "k8s-testing-w03"
      + ssh_host               = (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
        tags                   = "terraform"
      ~ vm_state               = "running" -> "stopped"
        # (44 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 6 to change, 0 to destroy.

  ```
  
  Plan exit code: 0
  